[
  {
    "blogId": 0,
    "blogTitle": "1999 by Joey Bada$$",
    "blogAuthor": "Arch Silverstein",
    "blogContent": "If you’re a fan of Wu-Tang, Nas, or MF DOOM, Joey Bada$$’s '1999' is an album you should listen to. It’s a great 90s New York Hip Hop album with accessible beats and slick flows for an overall enjoyable listen. As a 21 year old New Yorker, it somehow makes me nostalgic for a time I wasn’t even around for. Favorite three songs of the album are: ‘World Domination’, ‘Pennyroyal’, and ‘Righteous Minds’.",
    "blogImg": "https://i.scdn.co/image/ab67616d0000b273fcd3724fba954e6104e4530d"
  },
  {
    "blogId": 1,
    "blogTitle": "Alfredo by Freddie Gibbs and The Alchemist",
    "blogAuthor": "Arch Silverstein",
    "blogContent": "'Alfredo' by Freddie Gibbs and The Alchemist is an an amazing hip-hop album. Chill, cool, abstract hip-hop vibes. If you liked “Penalty of Leadership” by Nicholas Craven and Boldy James, you’ll love this one. It’s 35 minutes, but there’s so much replay value. It calms me down every time I listen to it (perfect for midterm season). Fav tracks 1) G-d Is Perfect [note: Jesus Christ, I love this song] 2) Something to Rap About 3) Baby $hit https://open.spotify.com/album/3znl1qe13kyjQv7KcR685N?si=PqUIHbkrRpWRQRyHFNN0-Q",
    "blogImg": "https://i.scdn.co/image/ab67616d0000b27352c24049a16d59e98a638651"
  },
  {
    "blogId": 2,
    "blogTitle": "Lahai by Sampha",
    "blogAuthor": "Arch Silverstein",
    "blogContent": "'Lahai' by Sampha is my favorite pop album from 2023 and it’s not even close. The series of fluttering keys and synths, Sampha’s uplifting and angelic vocals, and overall creative production makes this album is a must listen. With him having dropped the deluxe album adding 4 songs onto the already fantastic 14 tracks, it’s the perfect time to listen to it. Favorite 3 songs: 1) Only 2) Dancing Circles  3) Satellite Business 4) Spirit 2.0",
    "blogImg": "https://i.scdn.co/image/ab67616d0000b273791bcfd8ae1149dbb2375991"
  },
  {
    "blogId": 3,
    "blogTitle": "Run The Jewels by Run The Jewels",
    "blogAuthor": "Arch Silverstein",
    "blogContent": "Run The Jewels is a legendary NY/ATL Hip-Hop duo consisting of Killer Mike and El-P. Banger album, trails off a bit at the end, but strong first majority. It’s 33 minutes, give it a listen. Favorite Songs:  1) Run The Jewels 2) Banana Clippers  3) Sea Legs",
    "blogImg": "https://i.scdn.co/image/ab67616d0000b27343c27e535cefe3f389fff437"
  },
  {
    "blogId": 4,
    "blogTitle": "Neō Wax Bloom by Iglooghost",
    "blogAuthor": "Arch Silverstein",
    "blogContent": "'Neō Wax Bloom' answers the question: “what if you gave a chronically-online German teen $100 dollars on fiverr, a state of the art beat machine, and a baggie of cocaine to produce an instrumental album?” It fuses EDM, electronic, and alternative so well, it’s genuinely dizzying. It’s intense, in your face, and embodies the word zany. Idk if I have any favs off it, but if you want some hype shit, this album is for you. https://open.spotify.com/album/68aZtDbgNargCMYgNvw5JG?si=rRSjM8JMS8aVTsTw-AIA4Q",
    "blogImg": "https://i.scdn.co/image/ab67616d0000b2730c67ab993d8e939e97cf7a3f"
  },
  {
    "blogId": 5,
    "blogTitle": "Atrocity Exhibition by Danny Brown",
    "blogAuthor": "Arch Silverstein",
    "blogContent": "Danny Brown’s Atrocity Exhibition displays the cautionary tale of going on benders, while making the music so fuckin hard. TheNeedleDrop’s album of 2016, this experimental hip hop album has something for everybody. The production and Danny’s yelpy vocal inflection are a match made in heaven. My top three favs off of it: 1) Ain’t It Funny  2) Dance In The Water 3) When It Rains https://open.spotify.com/album/3A1vnUJDPz0xYMful9pO4I?si=J1qj5QnqQFyMzdlazzMF_A",
    "blogImg": "https://i.scdn.co/image/ab67616d0000b27306ce558a01af20d2837fb601"
  }
]
